const n=`\`\`\`mysql\r
定义数据库对象（数据库，表，字段）\r
\r
查询所有数据库\r
show databases/schema;\r
\r
查询当前数据库所有表\r
show tables;\r
\r
查询表结构\r
desc 表名；\r
\r
查询指定表的建表语句\r
show create table 表名；\r
\r
查询当前数据库\r
select database();\r
\r
使用/切换数据库\r
use 数据库名;\r
\r
创建数据库\r
creat database [if not exists] 数据库名 [default charset utf8mb4]；\r
\r
删除数据库\r
drop database [if exists]数据库名;\r
\r
创建表\r
create table 表名（\r
 字段1 字段1类型[comment 字段1注释]\r
 字段2 字段2类型[comment 字段2注释]\r
.........\r
字段n 字段n类型[comment 字段n注释]\r
)[commen 表注释]//例如engine=innodb//修改存储引擎类型;\r
\r
DLL-表操作-修改\r
添加字段\r
alter table 表名 add 字段名 类型（长度）【comment‘名称（可加可不加）’】【约束】；\r
\r
修改数据类型\r
alter table 表名modify 字段名 新数据类型（长度）；\r
\r
修改字段名和字段类型\r
alter table 表名 change 旧字段名 新字段名 类型（长度） 【comment  ‘用户名’】【约束】；\r
\r
删除字段\r
alter table 表名 drop 字段名；\r
\r
修改表名\r
alter table 表名 rename to 新表名；\r
\r
DDL-表操作-删除\r
删除表\r
drop table 【if exists】 表名； #其中的【】若有就删除，没有也不报错；\r
\r
删除指定表，并重新创建该表\r
truncate table 表名；  #不管哪个都会删除掉内容， 第二个保留表的结构\r
\`\`\`\r
\r
\r
\r
| 类型         | 大小(byte)                               | 有符号(SIGNED)范围                                           | 无符号(UNSIGNED)范围                                         | 描述                     | 备注                 |\r
| ------------ | ---------------------------------------- | ------------------------------------------------------------ | ------------------------------------------------------------ | ------------------------ | -------------------- |\r
| tinyint      | 1                                        | (-128,127)                                                   | (0,255)                                                      | 小整数值                 |                      |\r
| smallint     | 2                                        | (-32768 , 32767)                                             | (0,65535)                                                    | 大整数值                 |                      |\r
| mediumint    | 3                                        | (-8 388 608，8 388 607)                                      | (0，16 777 215)                                              | 大整数值                 |                      |\r
| INT或INTEGER | 4                                        | (-2 147 483 648，2 147 483 647)                              | (0，4 294 967 295)                                           | 大整数值                 |                      |\r
| BIGINT       | 8                                        | (-9,223,372,036,854,775,808，9 223 372 036 854 775 807)      | (0，18 446 744 073 709 551 615)                              | 极大整数值               |                      |\r
| FLOAT        | 4 Bytes                                  | (-3.402 823 466 E+38，-1.175 494 351 E-38)，0，(1.175 494 351 E-38，3.402 823 466 351 E+38) | 0，(1.175 494 351 E-38，3.402 823 466 E+38)                  | 单精度 浮点数值          |                      |\r
| DOUBLE       | 8 Bytes                                  | (-1.797 693 134 862 315 7 E+308，-2.225 073 858 507 201 4 E-308)，0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308) | 0，(2.225 073 858 507 201 4 E-308，1.797 693 134 862 315 7 E+308) | 双精度 浮点数值          |                      |\r
| DECIMAL      | 对DECIMAL(M,D) ，如果M>D，为M+2否则为D+2 | 依赖于M和D的值                                               | 依赖于M和D的值                                               | 小数值                   |                      |\r
| DATE         | 3                                        | 1000-01-01/9999-12-31                                        | YYYY-MM-DD                                                   | 日期值                   |                      |\r
| TIME         | 3                                        | '-838:59:59'/'838:59:59'                                     | HH:MM:SS                                                     | 时间值或持续时间         |                      |\r
| YEAR         | 1                                        | 1901/2155                                                    | YYYY                                                         | 年份值                   |                      |\r
| DATETIME     | 8                                        | '1000-01-01 00:00:00' 到 '9999-12-31 23:59:59'               | YYYY-MM-DD hh:mm:ss                                          | 混合日期和时间值         |                      |\r
| TIMESTAMP    | 4                                        | '1970-01-01 00:00:01' UTC 到 '2038-01-19 03:14:07' UTC结束时间是第 **2147483647** 秒，北京时间 **2038-1-19 11:14:07**，格林尼治时间 2038年1月19日 凌晨 03:14:07 | YYYY-MM-DD hh:mm:ss                                          | 混合日期和时间值，时间戳 |                      |\r
| CHAR         | 0-255 bytes                              | 定长字符串                                                   |                                                              |                          | 性能略高，浪费资源   |\r
| VARCHAR      | 0-65535 bytes                            | 变长字符串                                                   |                                                              |                          | 节约资源，性能略不好 |\r
| TINYBLOB     | 0-255 bytes                              | 不超过 255 个字符的二进制字符串                              |                                                              |                          |                      |\r
| TINYTEXT     | 0-255 bytes                              | 短文本字符串                                                 |                                                              |                          |                      |\r
| BLOB         | 0-65 535 bytes                           | 二进制形式的长文本数据                                       |                                                              |                          |                      |\r
| TEXT         | 0-65 535 bytes                           | 长文本数据                                                   |                                                              |                          |                      |\r
| MEDIUMBLOB   | 0-16 777 215 bytes                       | 二进制形式的中等长度文本数据                                 |                                                              |                          |                      |\r
| MEDIUMTEXT   | 0-16 777 215 bytes                       | 中等长度文本数据                                             |                                                              |                          |                      |\r
| LONGBLOB     | 0-4 294 967 295 bytes                    | 二进制形式的极大文本数据                                     |                                                              |                          |                      |\r
| LONGTEXT     | 0-4 294 967 295 bytes                    | 极大文本数据                                                 |                                                              |                          |                      |\r
|              |                                          |                                                              |                                                              |                          |                      |\r
\r
`;export{n as default};
